Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSet.StraightDimensionSetAttributes.Exaggeration Property
 The exaggeration attributes of the dimension.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DimensionSetBaseAttributes.DimensionExaggerationAttributes Exaggeration { get; set; }
Public Property Exaggeration As DimensionSetBaseAttributes.DimensionExaggerationAttributes
	Get
	Set
Property Value
Type: DimensionSetBaseAttributes.DimensionExaggerationAttributes
See Also
Reference
StraightDimensionSet.StraightDimensionSetAttributes Class
Tekla.Structures.Drawing Namespace